from django.db import migrations


def create_operations(apps, schema_editor):
    Operation = apps.get_model("pp_bac_app", "Operation")

    operations_list = [
        "Монтаж/демонтаж EPP",
        "Монтаж BC",
        "Монтаж/демонтаж BCR",
        "Монтаж NFC",
        "Монтаж T-NFC",
        "Монтаж TS",
        "Монтаж ACO",
        "Монтаж/демонтаж JP",
        "Монтаж RP",
        "Монтаж RPA",
        "Монтаж MCU",
        "Монтаж MCD",
        "Демонтаж фильтра конфиденциальности",
        "Монтаж OPLT 27\"-32\"",
        "Монтаж OPLT 15\"-19\"",
        "Демонтаж ключевого замка",
        "Демонтаж лимбового замка",
        "Замена сервисных замков",
        "Демонтаж тубуса",
        "Демонтаж заглушки с задней стенки сейфа",
        "Монтаж климатического пакета",
        "Монтаж винтов на заднюю крышку",
        "Сверление технологического отверстия",
        "Монтаж комплекта видеонаблюдения",
        "Монтаж/демонтаж штатных камер",
        "Монтаж аналоговых камер",
        "Монтаж связного оборудования",
        "Монтаж реле",
        "Перенос геркона",
        "Перенос кабелей сигнализации",
        "Замена/апгрейд системного блока",
        "Замена штатного диска",
        "Монтаж дополнительного HDD/SSD",
        "Демонтаж HDD 1Tb",
        "Монтаж сетевой карты",
        "Наращивание кабеля термодатчика верхнего отопителя",
        "Замена ИБП",
        "Монтаж фальщдвери",
        "Замена лицевой панели",
        "Монтаж рекламной конструкции",
        "Установка софта",
        "Установка Tellme",
        "Снятие слепка",
        "Установка лицензии",
        "Перенастройка кассет",
        "Маркировка кассет",
        "Маркировка ключей",
        "Вывод в боевой режим",
        "Покрашен",
        "Брендинг",
        "Тестирование штатной EPP",
        "Полное тестирование",
        "Неполное тестирование",
        "Монтаж электронного замка",
    ]

    for op_name in operations_list:
        Operation.objects.get_or_create(name=op_name)


class Migration(migrations.Migration):
    dependencies = [
        ("pp_bac_app", "0002_flow_operation_atm"),  # <- измените на вашу последнюю миграцию
    ]

    operations = [
        migrations.RunPython(create_operations),
    ]